/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strnequ.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: slupe <slupe@student.21-school.ru>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/11 23:01:47 by slupe             #+#    #+#             */
/*   Updated: 2019/09/11 23:01:47 by slupe            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_strnequ(char const *s1, char const *s2, size_t n)
{
	size_t i;

	i = 0;
	n--;
	if (s1 == 0 || s2 == 0)
		return (0);
	while ((*s1 != '\0') && (*s2 != '\0') && i != n)
	{
		if (*s1 != *s2)
			return (0);
		s1++;
		s2++;
		i++;
	}
	if ((*(s1-1) == *(s2-1)) && n >= 1) // убери этот колхоз ебаный
		return (1);
	return (0);
}
